''' Control Structure '''
'''
ในภาษา Python, Control Structures หรือโครงสร้างควบคุมเป็นเครื่องมือที่ช่วยให้เราสามารถควบคุมลำดับการทำงานของโปรแกรมได้ตามเงื่อนไขหรือการทำซ้ำที่กำหนด ซึ่งประกอบไปด้วยโครงสร้างควบคุมต่าง ๆ เช่น

Conditional Statements = if, else, elif
Loops = for, while
'''

''' 1. Conditional Statements '''
'''
Conditional Statements หรือ คำสั่งเงื่อนไข ซึ่งใช้ในการควบคุมการทำงานของโปรแกรมตามเงื่อนไขที่กำหนด คำสั่งเหล่านี้จะทำให้โปรแกรมตัดสินใจว่าจะทำอะไรต่อไปตามค่าของเงื่อนไขที่ได้เปรียบเทียบ
คำสั่ง if, else, และ elif ใช้ในการควบคุมการทำงานของโปรแกรมตามเงื่อนไขที่กำหนด โดย:

- if: ใช้ในการตรวจสอบเงื่อนไข หากเงื่อนไขเป็นจริง ( True) จะทำการประมวลผลคำสั่งที่อยู่ภายใต้บล็อกของ if
- elif: ย่อมาจาก "else if" ใช้สำหรับตรวจสอบเงื่อนไขเพิ่มเติม หากเงื่อนไขใน if หรือ elif ก่อนหน้านี้ไม่เป็นจริง
- else: ใช้เพื่อกำหนดคำสั่งที่จะถูกประมวลผลเมื่อทุกเงื่อนไขก่อนหน้าไม่เป็นจริง
'''
x = 10

if x > 0:
    print("x is positive")
elif x == 0:
    print("x is zero")
else:
    print("x is negative")
    
''' 
- หาก x มีค่ามากกว่า 0 (เช่น 10 ในตัวอย่างนี้) จะพิมพ์ "x is positive"
- หาก x มีค่าเท่ากับ 0 จะพิมพ์ "x is zero"
- หาก x มีค่าน้อยกว่า 0 จะพิมพ์ "x is negative" 
'''

''' 2. Loop '''
'''
Loops หรือ การวนซ้ำ ซึ่งใช้ในการทำซ้ำการทำงานของชุดคำสั่งจนกว่าเงื่อนไขที่กำหนดจะสิ้นสุด Loops ช่วยให้โปรแกรมสามารถประมวลผลข้อมูลหรือดำเนินการซ้ำได้ตามที่ต้องการ
โดย Python มี loop หลัก ๆ อยู่ 2 แบบคือ for และ while
'''

''' 1. for loop ใช้ในการทำซ้ำค่าหรือรายการที่กำหนด เช่น List, String, หรือลำดับของตัวเลข '''
# ทำซ้ำคำสั่งในช่วงตัวเลข 0 ถึง 4
for i in range(5):
    print(i)

# ทำซ้ำคำสั่งในรายการ
fruits = ["apple", "banana", "cherry"]
for fruit in fruits:
    print(fruit)
    
''' 
- ตัวอย่างแรกใช้ range(5) ซึ่งสร้างลำดับตัวเลขตั้งแต่ 0 ถึง 4 ( 5 ไม่รวม)
- ตัวอย่างที่สองใช้ for loop ในการวนลูปผ่านรายการ fruits และพิมพ์ชื่อผลไม้แต่ละตัวออกมา 
'''

''' 2. while Loop ใช้ในการทำซ้ำคำสั่งตราบเท่าที่เงื่อนไขที่กำหนดเป็นจริง ( True)
ตัวอย่าง code '''
count = 0

while count < 5:
    print("Count is:", count)
    count += 1
''' 
- ในตัวอย่างนี้ loop จะทำงานตราบเท่าที่ค่าของ count น้อยกว่า 5 ( count < 5)
- ในแต่ละรอบของลูป ค่าของ count จะถูกเพิ่มขึ้นทีละ 1 จนกว่าจะถึง 5 loop จึงจะหยุด
'''