''' Data Type (ชนิดของข้อมูล) '''
'''
ชนิดของข้อมูล หมายถึงประเภทของข้อมูลที่ตัวแปรสามารถเก็บได้ ใน Python มีชนิดของข้อมูลที่หลากหลาย และสามารถแบ่งได้เป็นกลุ่มใหญ่ ๆ ดังนี้:
'''

''' Numbers (ตัวเลข) '''
'''
- Integer (int): ตัวเลขจำนวนเต็ม เช่น 10, -3
- Float: ตัวเลขทศนิยม เช่น 3.14, -0.5
- Complex: ตัวเลขเชิงซ้อน เช่น 1 + 2j
'''
age = 25         # Integer
pi = 3.14159     # Float
complex_num = 1 + 2j  # Complex

''' String (ข้อความ) '''
''' ข้อมูลที่เป็นข้อความหรืออักขระ เช่น "Hello, World!", "Python" '''
message = "Hello, Python!"

''' Boolean (ค่าตรรกะ) '''
'''
มีค่าได้สองค่าเท่านั้น คือ True หรือ False
'''
is_open = True
is_closed = False

''' List (รายการ) '''
'''
เก็บข้อมูลหลายตัวในตัวแปรเดียว ข้อมูลใน List สามารถเป็นชนิดใดก็ได้และสามารถซ้ำกันได้
'''
fruits = ["apple", "banana", "cherry"]
numbers = [1, 2, 3, 4, 5]

''' Tuple '''
'''
คล้ายกับ List แต่ข้อมูลที่เก็บใน Tuple จะไม่สามารถเปลี่ยนแปลงได้หลังจากที่สร้างแล้ว
'''
coordinates = (10.0, 20.0)

''' Dictionary '''
''' เก็บข้อมูลในรูปแบบของคู่ key และ value ( key: value) '''
person = {"name": "Bas", "age": 25, "city": "Bangkok"}

''' Set '''
''' เก็บข้อมูลที่ไม่ซ้ำกัน และไม่มีลำดับ '''
unique_numbers = {1, 2, 3, 4, 5}